weaver/socialnetwork/evaluation/local/2024-08-02_15:17:50/workload.out
Running 30s test @ http://127.0.0.1:12345/wrk2-api/post/compose
  2 threads and 2 connections
  Thread calibration: mean lat.: 16.639ms, rate sampling interval: 54ms
  Thread calibration: mean lat.: 16.806ms, rate sampling interval: 52ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    16.64ms    7.79ms  45.34ms   85.89%
    Req/Sec    24.12     20.13    76.00     60.24%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   13.83ms
 75.000%   18.05ms
 90.000%   27.31ms
 99.000%   45.34ms
 99.900%   52.86ms
 99.990%   53.60ms
 99.999%   53.60ms
100.000%   53.60ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       8.903     0.000000            1         1.00
      10.543     0.100000           98         1.11
      11.191     0.200000          195         1.25
      11.919     0.300000          293         1.43
      12.719     0.400000          389         1.67
      13.831     0.500000          487         2.00
      14.551     0.550000          535         2.22
      15.159     0.600000          584         2.50
      15.903     0.650000          632         2.86
      16.703     0.700000          680         3.33
      18.079     0.750000          729         4.00
      19.407     0.775000          753         4.44
      20.799     0.800000          778         5.00
      22.159     0.825000          802         5.71
      23.743     0.850000          826         6.67
      25.359     0.875000          850         8.00
      26.319     0.887500          862         8.89
      27.311     0.900000          874        10.00
      28.863     0.912500          887        11.43
      29.951     0.925000          899        13.33
      31.775     0.937500          911        16.00
      33.407     0.943750          917        17.78
      34.783     0.950000          923        20.00
      35.391     0.956250          930        22.86
      36.863     0.962500          935        26.67
      38.751     0.968750          941        32.00
      39.295     0.971875          945        35.56
      39.967     0.975000          947        40.00
      41.087     0.978125          950        45.71
      41.631     0.981250          953        53.33
      42.943     0.984375          956        64.00
      43.935     0.985938          958        71.11
      44.543     0.987500          959        80.00
      45.343     0.989062          961        91.43
      45.599     0.990625          962       106.67
      46.399     0.992188          964       128.00
      47.487     0.992969          965       142.22
      47.487     0.993750          965       160.00
      48.799     0.994531          966       182.86
      48.959     0.995313          967       213.33
      49.183     0.996094          968       256.00
      49.183     0.996484          968       284.44
      49.183     0.996875          968       320.00
      51.231     0.997266          969       365.71
      51.231     0.997656          969       426.67
      52.863     0.998047          970       512.00
      52.863     0.998242          970       568.89
      52.863     0.998437          970       640.00
      52.863     0.998633          970       731.43
      52.863     0.998828          970       853.33
      53.599     0.999023          971      1024.00
      53.599     1.000000          971          inf
#[Mean    =       16.638, StdDeviation   =        7.790]
#[Max     =       53.568, Total count    =          971]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1506 requests in 30.00s, 862.97KB read
Requests/sec:     50.20
Transfer/sec:     28.76KB
